student = {
    "Фамилия": "Панчишин",
    "Имя": "Даниил",
    "Отчество": "Игоревич",
    "День рождения": "29.07.2002",
    "Класс": 204,
    "Любимые предметы": ["Базы данных", "Информатика", "Архитектура вычислительных систем"],
    "Место прописки": {
        "Страна":"Россия" ,
        "Город": "Кемерово",
        "Номер дома": "61",
        "Номер квартиры": "99"
    },
    "Место проживания": {
        "Страна":"Россия" ,
        "Город": "Кемерово",
        "Номер дома": "51",
        "Номер квартиры": "8"
    }
 }


console.log(student)